---
kind: other
id: Methods.T:Autodesk.Revit.DB.Plumbing.PipeType
source: html/a69d884c-af14-cb9c-f2f1-1afe8a60efb6.htm
---
# PipeType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.